results/fabio-512-run02/003_fio/artifacts/fio-output_512_4_io_uring-bdev_uring_2.txt
io_uring-bdev_uring: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=spdk_bdev, iodepth=4
fio-3.32-dirty
Starting 1 thread
{
  "fio version" : "fio-3.32-dirty",
  "timestamp" : 1666790307,
  "timestamp_ms" : 1666790307183,
  "time" : "Wed Oct 26 15:18:27 2022",
  "jobs" : [
    {
      "jobname" : "io_uring-bdev_uring",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 11,
      "job options" : {
        "name" : "io_uring-bdev_uring",
        "rw" : "randread",
        "size" : "12G",
        "iodepth" : "4",
        "bs" : "512",
        "direct" : "1",
        "thread" : "1",
        "time_based" : "1",
        "runtime" : "7",
        "ramp_time" : "3",
        "norandommap" : "1",
        "allow_file_create" : "0",
        "ioengine" : "spdk_bdev",
        "spdk_conf" : "/tmp/spdk_bdev_uring_foo.conf",
        "filename" : "Nvme0n1",
        "cpus_allowed" : "1"
      },
      "read" : {
        "io_bytes" : 1226106368,
        "io_kbytes" : 1197369,
        "bw_bytes" : 175133033,
        "bw" : 171028,
        "iops" : 342056.277675,
        "runtime" : 7001,
        "total_ios" : 2394736,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 110,
          "max" : 17543,
          "mean" : 182.469767,
          "stddev" : 147.807901,
          "N" : 2394736
        },
        "clat_ns" : {
          "min" : 5981,
          "max" : 134212,
          "mean" : 10884.014790,
          "stddev" : 3259.361616,
          "N" : 2394738,
          "percentile" : {
            "1.000000" : 6496,
            "5.000000" : 7392,
            "10.000000" : 7968,
            "20.000000" : 8384,
            "30.000000" : 8768,
            "40.000000" : 9024,
            "50.000000" : 9664,
            "60.000000" : 11712,
            "70.000000" : 12608,
            "80.000000" : 13120,
            "90.000000" : 13760,
            "95.000000" : 17536,
            "99.000000" : 21376,
            "99.500000" : 24192,
            "99.900000" : 30080,
            "99.950000" : 35072,
            "99.990000" : 67072
          }
        },
        "lat_ns" : {
          "min" : 6171,
          "max" : 134342,
          "mean" : 11066.484526,
          "stddev" : 3234.398550,
          "N" : 2394738
        },
        "bw_min" : 167302,
        "bw_max" : 174220,
        "bw_agg" : 100.000000,
        "bw_mean" : 171056.571429,
        "bw_dev" : 2202.020531,
        "bw_samples" : 14,
        "iops_min" : 334604,
        "iops_max" : 348440,
        "iops_mean" : 342113.142857,
        "iops_stddev" : 4404.041061,
        "iops_samples" : 14
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 7000,
      "usr_cpu" : 38.157143,
      "sys_cpu" : 61.814286,
      "ctx" : 13,
      "majf" : 0,
      "minf" : 0,
      "iodepth_level" : {
        "1" : 5.818804,
        "2" : 42.767136,
        "4" : 51.414060,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 51.271330,
        "20" : 47.557309,
        "50" : 1.134739,
        "100" : 0.035996,
        "250" : 0.010000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 4,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ]
}

io_uring-bdev_uring: (groupid=0, jobs=1): err= 0: pid=9088: Wed Oct 26 15:18:27 2022
  read: IOPS=342k, BW=167MiB/s (175MB/s)(1169MiB/7001msec)
    slat (nsec): min=110, max=17543, avg=182.47, stdev=147.81
    clat (usec): min=5, max=134, avg=10.88, stdev= 3.26
     lat (usec): min=6, max=134, avg=11.07, stdev= 3.23
    clat percentiles (nsec):
     |  1.00th=[ 6496],  5.00th=[ 7392], 10.00th=[ 7968], 20.00th=[ 8384],
     | 30.00th=[ 8768], 40.00th=[ 9024], 50.00th=[ 9664], 60.00th=[11712],
     | 70.00th=[12608], 80.00th=[13120], 90.00th=[13760], 95.00th=[17536],
     | 99.00th=[21376], 99.50th=[24192], 99.90th=[30080], 99.95th=[35072],
     | 99.99th=[67072]
   bw (  KiB/s): min=167302, max=174220, per=100.00%, avg=171056.57, stdev=2202.02, samples=14
   iops        : min=334604, max=348440, avg=342113.14, stdev=4404.04, samples=14
  lat (usec)   : 10=51.27%, 20=47.56%, 50=1.13%, 100=0.04%, 250=0.01%
  cpu          : usr=38.16%, sys=61.81%, ctx=13, majf=0, minf=0
  IO depths    : 1=5.8%, 2=42.8%, 4=51.4%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2394736,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=167MiB/s (175MB/s), 167MiB/s-167MiB/s (175MB/s-175MB/s), io=1169MiB (1226MB), run=7001-7001msec